# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..Contains Method
MEPBuildingConstructionSet Class See Also
---
Tests for the existence of a MEPBuildingConstruction within the set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	MEPBuildingConstruction item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As MEPBuildingConstruction _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	MEPBuildingConstruction^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Mechanical..::..MEPBuildingConstructionThe MEPBuildingConstruction to be searched for.
# ### Return Value
The Contains method returns True if the MEPBuildingConstruction is within the set, otherwise False.
# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace